# Tonnes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Tonnes Property
UnitTypeId Class See Also
---
Tonnes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Tonnes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Tonnes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Tonnes {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace